### Pengenalan Function

<b>created by</b> : Muhammad Ammar Fauzan | maf.fauzan@gmail.com

#### Function Sederhana

In [ ]:
#Contoh implementasi function
def function_name(paremeter(s)):
    <statement(s)>

In [1]:
def penjumlahan(a, b):
    hasil_jumlah = a+b #statement 1
    print(hasil_jumlah) #statement 2

In [2]:
penjumlahan(2, 8)

10

#### Function Sederhana dengan Return Value dan Parater

In [3]:
def penjumlahan(a, b):
    hasil_jumlah = a+b #statement 1
    return hasil_jumlah #return statement

In [4]:
penjumlahan(2, 8)

10

#### Mengapa Butuh Function

In [5]:
def kalkulator_sederhana(metode, a, b): #membuat fungsi kalkulator sederhana dengan 2 parameter metode, a dan b
    if metode == 'Penjumlahan':
        hasil = a + b
    elif metode == 'Pengurangan':
        hasil = a - b
    else:
        hasil = 'Input salah / Metode tidak dikenali'
    return hasil

print(kalkulator_sederhana('Penjumlahan',2,3)) #kebutuhan 1
print(kalkulator_sederhana('Penjumlahan',5,10)) #kebutuhan 2
print(kalkulator_sederhana('Pengurangan',20,10)) #kebutuhan 3

5
15
10

#### Global dan Local Variabel

In [6]:
x = 'ini global variabel'

def belajar_global_local(x):
    x = 'ini local variabel' #nilai x dirubah value nya
    print(x)

belajar_global_local(x) #function call
print(x)

ini local variabel
ini global variabel

In [7]:
a = 10

def pangkat(x, n):
    a = x**n #nilai a adalah operasi x pangkat n
    print('Variabel a local', a)
    
pangkat(2, 3)
print('Variabel a global', a)

Variabel a local 8
Variabel a global 10

In [8]:
hasil_bagi = 0

def contoh_local_to_global(a, b):
    global hasil_bagi #menjadikan variable local menjadi global
    hasil_bagi = a/b
    return hasil_bagi

In [9]:
contoh_local_to_global(8, 2)

4.0

In [10]:
print(hasil_bagi)

4.0

### Input Parameter Function

#### Tanpa Parameter

In [3]:
from datetime import date
from datetime import timedelta

def get_yesterday(): #tidak ada param
    today = date.today()
    yesterday = today - timedelta(days = 1)
    return yesterday 
    
print('Hari ini tanggal',date.today())

print('Kemarin tanggal',get_yesterday()) #tidak ada param

Hari ini tanggal 2022-08-21
Kemarin tanggal 2022-08-20

#### 2 Paramater

In [4]:
def luas_segitiga(a, t): #membuat fungsi luas segitiga dengan 2 parameter a dan t
    hasil = (a*t)/2 #melakukan operasi luas segita alas(a)*tinggi(t)*1/2
    return hasil #mengerluarkan output variabel hasil 

luas_segitiga(6,3) #menginputkan 2 parameter, dimana a = 6 dan t = 3

9.0

In [5]:
luas_segitiga(6) #menginputkan 2 parameter, dimana a = 6 dan t = 3

TypeError: luas_segitiga() missing 1 required positional argument: 't'

#### Parameter Optional

In [6]:
import pandas as pd

In [7]:
df = pd.read_csv('monthly_rakamin_customer_order.csv')
df.head()

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit
0,2018-01-01,Ahmad Budiman,10000011,628785222211,Jakarta Pusat,DKI Jakarta,ahmad@gmail.com,125,3490000,230
1,2018-01-01,Azzam Haqq,10000012,628785222212,Surabaya,Jawa Timur,azzam@gmail.co.id,173,4757500,304
2,2018-01-01,Amrina Putri,10000013,628785222213,Jakarta Pusat,DKI Jakarta,amrina@yahoo.co.id,20,550000,62
3,2018-01-01,Aan Utama,10000014,628785222214,Medan,Sumatra Utara,aan@yahoo.com,18,495000,100
4,2018-01-01,Adam Adi,10000015,628785222215,Jakarta Timur,DKI Jakarta,adam@gmail.com,159,4372500,524

In [10]:
df.describe() #shift + tab untuk melihat dokumentasi

            user_id         phone  total_order     total_gmv  total_visit
count  3.370000e+02  3.370000e+02   337.000000  3.370000e+02   337.000000
mean   1.000003e+07  6.285582e+11    98.587537  2.712085e+06   258.471810
std    1.188643e+01  2.560407e+08    56.912257  1.565805e+06   176.123299
min    1.000001e+07  6.282234e+11     2.000000  5.500000e+04     6.000000
25%    1.000002e+07  6.282234e+11    52.000000  1.430000e+06   103.000000
50%    1.000003e+07  6.285678e+11    99.000000  2.722500e+06   251.000000
75%    1.000004e+07  6.287852e+11   150.000000  4.152500e+06   341.000000
max    1.000006e+07  6.289622e+11   205.000000  5.600000e+06   773.000000

In [17]:
def city_order(month, city1, city2=None, city3=None): 
    #filter dataframe based on Month and City
    df_selected_city = df[(df.order_month == month) & (df.city.isin([city1, city2, city3]))]
    
    #get trx agregat function sum
    total_trx = df_selected_city.total_order.sum()
    
    #print
    print('Total Trx pada Bulan', month, 'dari kota-kota tersebut adalah', total_trx)

In [18]:
city_order('2018-08-01', 'Jakarta Pusat') #menginputkan 2 parameter saja untuk month dan city 1

Total Trx pada Bulan 2018-08-01 dari kota-kota tersebut adalah 45

In [19]:
city_order('2021-09-01', 'Jakarta Pusat', city2 = 'Bandung') #menginputkan 3 parameter untuk month, city1 dan city2

Total Trx pada Bulan 2021-09-01 dari kota-kota tersebut adalah 134

#### Parameter dengan default input

In [20]:
def user_order(user_id, month='2021-09-01'):
    #filter dataframe based on Month and User
    df_selected_user_monthly = df[(df.order_month == month) 
                                 & (df.user_id == user_id)].reset_index()
    
    #get order agregat function sum
    total_trx = df_selected_user_monthly.total_order.sum()
    
    #print
    print('Total Trx pada Bulan', month, 'untuk user_id',user_id,'adalah',total_trx)

In [21]:
user_order(10000038)

Total Trx pada Bulan 2021-09-01 untuk user_id 10000038 adalah 61

In [22]:
user_order(10000038, '2020-01-01') #value default akan ter replace dengan input baru

Total Trx pada Bulan 2020-01-01 untuk user_id 10000038 adalah 26

#### Mini Quiz | Challenge Time #1

Buatlah function <b>my_calculator</b> yang bisa menghitung 2 variabel angka dengan 4 alternatif metode operasi: (parameter metode by default Penjumlahan)
- Penjumlahan
- Pengurangan
- Perkalian
- Pembagian

In [15]:
#1 Function my_calculator

### Return Value

#### Mengapa perlu output pada function

In [23]:
def cek_genap(x):
    if x%2 == 0:
        hasil = 'Genap'
    else:
        hasil = 'Ganjil'
    return hasil

In [24]:
y = 101 #variabel yang akan dicek
print('Bilangan',y, 'termasuk bilangan', cek_genap(y))

Bilangan 101 termasuk bilangan Ganjil

In [25]:
# rumus: sisi x sisi
def luas_persegi(sisi):
    luas = sisi * sisi
    return luas


# rumus: sisi x sisi x sisi
def volume_persegi(sisi):
    volume = luas_persegi(sisi) * sisi #menggunakan fungsi dalam fungsi
    return volume

volume_persegi(5)

125

#### Implementasi Function dengan Banyak Return Statement

In [26]:
def kalkulator(metode, a, b):
    metode = metode.lower()
    if metode == 'penjumlahan':
        hasil = a+b
        return hasil #return statement 1
    elif metode == 'pengurangan':
        hasil = a-b
        return hasil #return statement 2
    else:
        hasil = '-'
    print('Inputan metode', metode, 'dengan inputan', a, 'dan', b, ' tidak sesuai system inputan', hasil)

In [27]:
kalkulator('penjumlahan', 5, 15)

20

In [28]:
kalkulator('penjum', 5, 6)

Inputan metode penjum dengan inputan 5 dan 6  tidak sesuai system inputan -

#### Output pada Function bisa lebih dari 1

In [29]:
def luas_volume_balok(p, l, t):
    luas = p*l
    volume = p*l*t
    return luas, volume #output akan berwujud tuple

df_info = luas_volume_balok(2,4,6)
print('Luas', df_info[0], 'cm2 dan Volume', df_info[1], 'cm3')

Luas 8 cm2 dan Volume 48 cm3

In [30]:
nilai_luas, nilai_volume = luas_volume_balok(2,4,6) #mendfinisikan 2 variabel langsung
print('Ini Nilai Luas', nilai_luas)
print('Ini Nilai Volume', nilai_volume)

Ini Nilai Luas 8
Ini Nilai Volume 48

### Dataframe with function

Jika kita memiliki 3 segment user
1. total_order < 20 --> low buyer
2. total_order >= 20 and total_order < 100 --> mid buyer
3. total_order >= 100 --> high buyer

Ada banyak cara untuk membuat kolom baru pada suatu dataframe, salah satu cara nya dengan melakukan iterasi for

In [34]:
import pandas as pd
# pd.options.display.float_format = '{:,.0f}'.format

In [35]:
df = pd.read_csv('monthly_rakamin_customer_order.csv')
df.head()

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit
0,2018-01-01,Ahmad Budiman,10000011,628785222211,Jakarta Pusat,DKI Jakarta,ahmad@gmail.com,125,3490000,230
1,2018-01-01,Azzam Haqq,10000012,628785222212,Surabaya,Jawa Timur,azzam@gmail.co.id,173,4757500,304
2,2018-01-01,Amrina Putri,10000013,628785222213,Jakarta Pusat,DKI Jakarta,amrina@yahoo.co.id,20,550000,62
3,2018-01-01,Aan Utama,10000014,628785222214,Medan,Sumatra Utara,aan@yahoo.com,18,495000,100
4,2018-01-01,Adam Adi,10000015,628785222215,Jakarta Timur,DKI Jakarta,adam@gmail.com,159,4372500,524

In [31]:
df.describe(percentiles=[.1,.25, .5, .75, .9, .95, .99])

         user_id           phone  total_order  total_gmv  total_visit
count        270             270          270        270          270
mean  10,000,030 628,581,796,686           99  2,734,722          261
std           11     249,857,308           58  1,586,998          181
min   10,000,011 628,223,412,511            2     55,000            6
10%   10,000,014 628,223,412,514           20    550,000           62
25%   10,000,020 628,223,412,521           52  1,430,000          101
50%   10,000,030 628,567,812,320          100  2,750,000          253
75%   10,000,039 628,785,222,216          153  4,200,625          337
90%   10,000,046 628,962,212,421          175  4,815,250          550
95%   10,000,048 628,962,212,423          186  5,102,625          636
99%   10,000,050 628,962,212,425          198  5,434,550          710
max   10,000,050 628,962,212,425          200  5,500,000          745

In [33]:
list_segment = [] #membuat list kosong
for i, kolom in df.iterrows(): #melakukan iterasi pada setiap baris dataframe
    if kolom['total_order'] >= 100:
        segment = 'high'
    elif kolom['total_order'] >= 20 and kolom['total_order'] < 100:
        segment = 'mid'
    else:
        segment = 'low'
    list_segment.append(segment) #menambahkan list kosong dari item tiap row
    
df['segment_for'] = list_segment
df.head()

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit,segment_for
0,2018-01-01,Ahmad Budiman,10000011,628785222211,Jakarta Pusat,DKI Jakarta,ahmad@gmail.com,125,3490000,230,high
1,2018-01-01,Azzam Haqq,10000012,628785222212,Surabaya,Jawa Timur,azzam@gmail.co.id,173,4757500,304,high
2,2018-01-01,Amrina Putri,10000013,628785222213,Jakarta Pusat,DKI Jakarta,amrina@yahoo.co.id,20,550000,62,mid
3,2018-01-01,Aan Utama,10000014,628785222214,Medan,Sumatra Utara,aan@yahoo.com,18,495000,100,low
4,2018-01-01,Adam Adi,10000015,628785222215,Jakarta Timur,DKI Jakarta,adam@gmail.com,159,4372500,524,high

Namun ada, cara yang secara performance waktu lebih cepat (efisien)

In [34]:
#membuat function segment
def segment(x):
    if x['total_order'] >= 100:
        segment = 'high'
    elif x['total_order'] >= 20 and x['total_order'] < 100:
        segment = 'mid'
    else:
        segment = 'low'
    return segment

In [35]:
df['segment_apply'] = df.apply(lambda x: segment(x), axis=1)
df.head()

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit,segment_for,segment_apply
0,2018-01-01,Ahmad Budiman,10000011,628785222211,Jakarta Pusat,DKI Jakarta,ahmad@gmail.com,125,3490000,230,high,high
1,2018-01-01,Azzam Haqq,10000012,628785222212,Surabaya,Jawa Timur,azzam@gmail.co.id,173,4757500,304,high,high
2,2018-01-01,Amrina Putri,10000013,628785222213,Jakarta Pusat,DKI Jakarta,amrina@yahoo.co.id,20,550000,62,mid,mid
3,2018-01-01,Aan Utama,10000014,628785222214,Medan,Sumatra Utara,aan@yahoo.com,18,495000,100,low,low
4,2018-01-01,Adam Adi,10000015,628785222215,Jakarta Timur,DKI Jakarta,adam@gmail.com,159,4372500,524,high,high

In [12]:
def segment_new(province, total_order):
    if (province == 'DKI Jakarta') and (total_order >= 75):
        segment = 'Potential'
    else:
        segment = 'Not Potential'
        
    return segment

In [37]:
#spesific memasukan kolom tertentu
df['segment_apply'] = df.apply(lambda x: segment_new(x['province'], x['total_order']), axis=1)

In [13]:
df.head()

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit
0,2018-01-01,Ahmad Budiman,10000011,628785222211,Jakarta Pusat,DKI Jakarta,ahmad@gmail.com,125,3490000,230
1,2018-01-01,Azzam Haqq,10000012,628785222212,Surabaya,Jawa Timur,azzam@gmail.co.id,173,4757500,304
2,2018-01-01,Amrina Putri,10000013,628785222213,Jakarta Pusat,DKI Jakarta,amrina@yahoo.co.id,20,550000,62
3,2018-01-01,Aan Utama,10000014,628785222214,Medan,Sumatra Utara,aan@yahoo.com,18,495000,100
4,2018-01-01,Adam Adi,10000015,628785222215,Jakarta Timur,DKI Jakarta,adam@gmail.com,159,4372500,524

#### Sekilas tentang Apply

In [39]:
import numpy as np
df_apply = pd.DataFrame([[2, 8]] * 3, columns=['A', 'B'])

df_apply

   A  B
0  2  8
1  2  8
2  2  8

In [40]:
df_apply.apply(np.sum, axis=0) #melakukan agregat sum tiap kolom

A     6
B    24
dtype: int64

In [41]:
df_apply.apply(np.sum, axis=1) #melakukan agregat sum tiap baris

0    10
1    10
2    10
dtype: int64

#### Sekilas tentang Lambda

In [42]:
x = lambda a, b : a * b
print(x(5, 6))

30

In [43]:
x = lambda x: 'Genap' if x%2 == 0 else 'Ganjil'
print(x(8))

Genap

#### Penerapan apply lambda tanpa membuat function

In [44]:
df['jakpus'] = df['city'].apply(lambda x: True if x == 'Jakarta Pusat' else False)
df.head()

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit,segment_for,segment_apply,jakpus
0,2018-01-01,Ahmad Budiman,10000011,628785222211,Jakarta Pusat,DKI Jakarta,ahmad@gmail.com,125,3490000,230,high,Potential,True
1,2018-01-01,Azzam Haqq,10000012,628785222212,Surabaya,Jawa Timur,azzam@gmail.co.id,173,4757500,304,high,Not Potential,False
2,2018-01-01,Amrina Putri,10000013,628785222213,Jakarta Pusat,DKI Jakarta,amrina@yahoo.co.id,20,550000,62,mid,Not Potential,True
3,2018-01-01,Aan Utama,10000014,628785222214,Medan,Sumatra Utara,aan@yahoo.com,18,495000,100,low,Not Potential,False
4,2018-01-01,Adam Adi,10000015,628785222215,Jakarta Timur,DKI Jakarta,adam@gmail.com,159,4372500,524,high,Potential,False

In [36]:
df['year'] = df['order_month'].apply(lambda x: x[:4]) #fokus 1 kolom dan tidak begitu complex
df.head()

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit,year
0,2018-01-01,Ahmad Budiman,10000011,628785222211,Jakarta Pusat,DKI Jakarta,ahmad@gmail.com,125,3490000,230,2018
1,2018-01-01,Azzam Haqq,10000012,628785222212,Surabaya,Jawa Timur,azzam@gmail.co.id,173,4757500,304,2018
2,2018-01-01,Amrina Putri,10000013,628785222213,Jakarta Pusat,DKI Jakarta,amrina@yahoo.co.id,20,550000,62,2018
3,2018-01-01,Aan Utama,10000014,628785222214,Medan,Sumatra Utara,aan@yahoo.com,18,495000,100,2018
4,2018-01-01,Adam Adi,10000015,628785222215,Jakarta Timur,DKI Jakarta,adam@gmail.com,159,4372500,524,2018

#### Mini Quiz | Challenge Time #2

menggunakan dataset <b>monthly_rakamin_customer_order</b>, buatlah kolom baru dengan nama provider_email dengan ketentuan berdasarkan domain emailnya:
- gmail  Google
- yahoo  Yahoo

Gunakan syntax apply lambda dan .split('@')! Tentukan provider email apa yang paling banyak digunakan customer pada tahun 2021

In [37]:
import pandas as pd

In [38]:
df_monthly_rakamin = pd.read_csv('monthly_rakamin_customer_order.csv')
df_monthly_rakamin.head()

,order_month,full_name,user_id,phone,city,province,email,total_order,total_gmv,total_visit
0,2018-01-01,Ahmad Budiman,10000011,628785222211,Jakarta Pusat,DKI Jakarta,ahmad@gmail.com,125,3490000,230
1,2018-01-01,Azzam Haqq,10000012,628785222212,Surabaya,Jawa Timur,azzam@gmail.co.id,173,4757500,304
2,2018-01-01,Amrina Putri,10000013,628785222213,Jakarta Pusat,DKI Jakarta,amrina@yahoo.co.id,20,550000,62
3,2018-01-01,Aan Utama,10000014,628785222214,Medan,Sumatra Utara,aan@yahoo.com,18,495000,100
4,2018-01-01,Adam Adi,10000015,628785222215,Jakarta Timur,DKI Jakarta,adam@gmail.com,159,4372500,524

### Pengenalan Error and Exception

#### 1. Syntax Error

Error yang terjadi saat syntax yang dituliskan tidak sesuai dengan standar penulisan python programming.

##### Contoh 1

In [24]:
print'Hi! All'

SyntaxError: invalid syntax (<ipython-input-24-077be39d2fce>, line 1)

##### Contoh 2

In [25]:
if metode == 'Penjumlahan':
result = a+b

IndentationError: expected an indented block (<ipython-input-25-fcac8b070bf6>, line 2)

#### 2. Logical Error

Terjadinya error setelah berhasil mengeksekusi syntax test disebut exception / logical type.

##### Contoh Index Error

In [27]:
a = [1, 2, 3, 4]

a[5]

IndexError: list index out of range

##### Contoh ZeroDivisionError

In [28]:
a = 1
b = 0

c = a/b
#error karena secara logic suatu bilangan tidak boleh di bagi 0

ZeroDivisionError: division by zero

##### Contoh NameError

In [29]:
print(company_name)
#error karena variable company_name belum di definisikan

NameError: name 'company_name' is not defined

##### Contoh TypeError

In [30]:
angka = 12
kata = 'Ammar'

angka + kata
#type error karena type data int ditambahkan string

TypeError: unsupported operand type(s) for +: 'int' and 'str'

##### Contoh AttributeError

In [31]:
angka = 12

angka.append(13)
#type error karena type int tidak memiliki fungsi append

AttributeError: 'int' object has no attribute 'append'

##### Contoh ImportError

In [32]:
import tensorflow

ModuleNotFoundError: No module named 'tensorflow'

#### 2.1 Handling Logical Erro (Try ... Except - Finally Statement)

In [33]:
# put unsafe operation in try block
try:
    print("Start")
    
    # unsafe operation perform
    print(1 / 0) 

# if error occur the it goes in except block
except:
    print("Muncul Error")
    
# final code in finally block
finally:
    print("Finish!")

Start
Muncul Error
Finish!

#### Mini Quiz | Challenge Time #3

Setelah berhasil melakukan pembuatan kolom provider_email pada Mini Quiz sebelumnya, coba lakukan hal yang sama pada Mini Quiz #2 pada dataset <b>summary_buyer_rakamin_store_special.csv </b>!

Apakah mengalami Error? 

Coba lakukan <i>solve issue</i> pembuatan kolom baru pada dataset summary_buyer_rakamin_store_special.csv dengan try and except statement!

In [45]:
import pandas as pd

df_monthly_special = pd.read_csv('summary_buyer_rakamin_store_special.csv')
df_monthly_special.head()

,order_month,user_id,full_name,phone,city,province,email,total_order,total_gmv,total_visit
0,2018-01-01,10000011,Ahmad Budiman,6.287852e+11,Jakarta Pusat,DKI Jakarta,ahmad@gmail.com,127,3492500,235
1,2018-01-01,10000012,Azzam Haqq,6.287852e+11,Surabaya,Jawa Timur,azzam@gmail.co.id,173,4757500,304
2,2018-01-01,10000013,Amrina Putri,6.287852e+11,Jakarta Pusat,DKI Jakarta,amrina@yahoo.co.id,20,550000,62
3,2018-01-01,10000014,Aan Utama,6.287852e+11,Medan,Sumatra Utara,aan@yahoo.com,18,495000,100
4,2018-01-01,10000015,Adam Adi,6.287852e+11,Jakarta Timur,DKI Jakarta,adam@gmail.com,159,4372500,524

### Tetap Semangat Belajar Python, Good Luck!